#### Terragrunt Plan: `environments/personal/repositories/playground`
```
[90m02:23:33.259 [0m[37mSTDOUT [0m[36mterraform: [0mAcquiring state lock. This may take a few moments...
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform used the selected providers to generate the following execution
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m  + create
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform will perform the following actions:
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m  # github_repository.this[0] will be created
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m  + resource "github_repository" "this" {
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + allow_auto_merge                        = false
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + allow_forking                           = (known after apply)
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + allow_merge_commit                      = true
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + allow_rebase_merge                      = true
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + allow_squash_merge                      = true
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + archived                                = false
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + auto_init                               = true
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + default_branch                          = (known after apply)
[90m02:23:35.329 [0m[37mSTDOUT [0m[36mterraform: [0m      + delete_branch_on_merge                  = true
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + description                             = "Personal playground for experimenting with various technologies (Valkey, Kafka, Postgres, etc.)"
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + etag                                    = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + fork                                    = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + full_name                               = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + git_clone_url                           = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + has_discussions                         = false
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + has_issues                              = true
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + has_projects                            = false
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + has_wiki                                = false
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + html_url                                = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + http_clone_url                          = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + id                                      = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + ignore_vulnerability_alerts_during_read = false
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + merge_commit_message                    = "PR_TITLE"
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + merge_commit_title                      = "MERGE_MESSAGE"
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + name                                    = "playground"
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + node_id                                 = (known after apply)
[90m02:23:35.330 [0m[37mSTDOUT [0m[36mterraform: [0m      + primary_language                        = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + private                                 = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + repo_id                                 = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + source_owner                            = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + source_repo                             = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + squash_merge_commit_message             = "COMMIT_MESSAGES"
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + ssh_clone_url                           = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + svn_url                                 = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + topics                                  = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + visibility                              = "public"
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + vulnerability_alerts                    = true
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + web_commit_signoff_required             = false
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m      + security_and_analysis (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0mPlan: 1 to add, 0 to change, 0 to destroy.
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0mChanges to Outputs:
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m  + repo_id         = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m  + repository_id   = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m  + repository_name = "playground"
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m  + repository_url  = (known after apply)
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[90m02:23:35.331 [0m[37mSTDOUT [0m[36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[90m02:23:35.332 [0m[37mSTDOUT [0m[36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```

*Pushed by: @elayaraja-kv*